tutorials/fluidSolidInteraction/beamInCrossFlow/linearGeometryElasticBeam.openfoam/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          256;
        startFace       41600;
    }
    outlet
    {
        type            patch;
        nFaces          256;
        startFace       41856;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          928;
        startFace       42112;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          896;
        startFace       43040;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          928;
        startFace       43936;
    }
    symmetry
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          896;
        startFace       44864;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       45760;
    }
)

// ************************************************************************* //
